package query;

public class Learn_SQL {
/**
 SQL은 데이터베이스에 다루고 접근하기 위한 스탠다드 언어이다.
 구조화된 쿼리 언어이다.
 데이터베이스를 다루고 접근한다.
 1986년 ANSI, 1987년 ISO의 기준이다.

 SQL로 무엇을 할 수 있을까?

 데이터베이스에 대해 쿼리를 실행
 데이터베이스로 부터 데이터를 조회
 데이터베이스에 기록을 삽입, 갱신, 삭제
 새로운 데이터베이스 생성
 데이터베이스에 새로운 테이블 생성
 데이터베이스에 stored procedures를 생성
 데이터베이스에 뷰를 생성
 테이블, 프로시져, 뷰에 허가를 셋 할 수 있다

 SQL이 ANSI/ISO의 기준이라 할지라도, SQL언어의 다른 버전들도 존재한다.
 그렇지만 SELECT, UPDATE, DELETE, INSERT, WHERE와 같은 주요 명령어는 지원된다.

 웹사이트에 SQL을 사용하면?

 데이터베이스로 부터 데이터를 보여주는 웹사이트를 구축하기 위해서 다음과 같은 것들이 필요하다.

 1. RDBMS 데이터베이스 프로그램 ex) MySQL
 2. 서버사이드 스크립트 언어 (JSP,PHP?)
 3. SQL을 통해 얻고자 하는 데이터
 4. HTML/CSS 스타일의 페이지

 RDBMS?

 RDBMS: Relational Database Management System
 RDBMS는 모든 데이터베이스 시스템과 SQL의 토대이다.
 RDBMS의 데이터는 테이블이라고 불리는 데이터베이스 객체로 저장된다.
 테이블은 연관된 데이터의 컬렉션이고, 행과 열로 이루어진다.















벨로그 IKU_JO님의 학습블로그를 참고하여 복습을 위하여 해당포스팅의 정리내용을 필사하면서 기록하였음을 밝힙니다.

































 **/
}
